import { Question } from '../types';

export const questions_ru: Question[] = [
  {
    id: 2,
    gid: '1',
    tid: '1',
    q: 'Который из знаков означает "Объезд препятствия слева"?',
    a1: '1',
    a2: '2',
    a3: '3',
    a4: '4',
    a5: '5',
    currect: 'a3',
    img: '2',
  },
  {
    id: 3,
    gid: '1',
    tid: '1',
    q: 'Разрешается ли водителю автобуса въехать на перекресток в данной ситуации?',
    a1: 'Разрешается',
    a2: 'Запрещается',
    a3: 'Разрешается, если автобус движется по установленному маршруту',
    currect: 'a2',
    img: '3',
  },
  {
    id: 4,
    gid: '1',
    tid: '1',
    q: 'Из какой полосы следует выполнять поворот направо в указанной ситуации?',
    a1: 'Только из второй полосы',
    a2: 'Только из крайней правой полосы, обозначенной разметкой "А"',
    currect: 'a2',
    img: '4',
  },
];
